// data/cocktailData.ts
export interface Cocktail {
	name: string;
	ingredients: string[];
	preparation: string;
}

export const cocktails: Cocktail[] = [
	{
		name: 'Классический Negroni',
		ingredients: ['30 мл джина', '30 мл Campari', '30 мл вермута (или дополнительный Campari)', 'Лед', 'Апельсиновая корка (по желанию)'],
		preparation: 'Смешайте джин, Campari и вермут (или дополнительный Campari) в стакане с льдом. Перемешайте и украсьте апельсиновой коркой.',
	},
	{
		name: 'Aperol Spritz',
		ingredients: ['60 мл апероля', '90 мл шампанского или игристого вина (или газированная вода)', '30 мл тоника', 'Лед', 'Апельсин (долька для украшения)'],
		preparation: 'Наполните бокал льдом.\n' +
			'Добавьте апероль, шампанское и тоник.\n' +
			'Аккуратно перемешайте и украсьте долькой апельсина.',
	},
	{
		name: 'Vodka Tonic',
		ingredients: ['50 мл водки', '150 мл тоника', 'Лед', 'Лимон (долька для украшения)', 'Апельсин (долька для украшения)'],
		preparation: 'Наполните стакан льдом. Добавьте водку и тоник. Перемешайте и украсьте долькой лимона.',
	},
	{
		name: 'Gin Tonic',
		ingredients: ['50 мл джина', '150 мл тоника', 'Лед', 'Лайм (долька для украшения)', 'Апельсин (долька для украшения)'],
		preparation: 'Наполните стакан льдом.\n' +
			'Добавьте джин и тоник.\n' +
			'Перемешайте и украсьте долькой лайма.',
	},
	{
		name: 'Rum & Tonic',
		ingredients: ['50 мл рома', '150 мл тоника', 'Лед', 'Лайм (долька для украшения)', 'Лайм (долька для украшения)'],
		preparation: 'Наполните стакан льдом. Добавьте ром и тоник.	Перемешайте и украсьте долькой лайма.',
	},
	{
		name: 'Campari & Tonic',
		ingredients: ['50 мл Campari', '150 мл тоника', 'Лед', 'Лимон (долька для украшения)'],
		preparation: 'Наполните стакан льдом.\n' +
			'Добавьте Campari и тоник.\n' +
			'Перемешайте и украсьте долькой лимона.',
	},
	{
		name: 'Classic Vodka Martini (если есть вермут)',
		ingredients: ['50 мл водки', '10 мл вермута (если нет, просто водка)', 'Лед', 'Лимонная корка или оливка (для украшения)'],
		preparation: 'Смешайте водку и вермут (если используете) в стакане со льдом. Процедите в охлажденный бокал для мартини и украсьте лимонной коркой или оливкой.',
	},
	{
		name: 'Aperol & Campari Spritz',
		ingredients: ['30 мл апероля', '30 мл Campari', '90 мл шампанского или игристого вина (или газированная вода)', 'Лед', 'Апельсин (долька для украшения)'],
		preparation: 'Наполните бокал льдом.\n' +
			'Добавьте апероль, Campari и шампанское.\n' +
			'Аккуратно перемешайте и украсьте долькой апельсина.',
	},
	{
		name: 'Vodka Red Bull',
		ingredients: ['50 мл водки', '150 мл Red Bull', 'Лед'],
		preparation: 'Наполните стакан льдом. Добавьте водку. Долейте Red Bull. Перемешайте и подавайте.',
	},
	{
		name: 'Vodka Red Bull Lime',
		ingredients: ['50 мл водки', '150 мл Red Bull', 'Лед', 'Лайм (долька для украшения)'],
		preparation: 'Наполните стакан льдом. Добавьте водку. Долейте Red Bull. Перемешайте и украсьте долькой лайма.',
	},
	{
		name: 'Vodka Red Bull Spritz',
		ingredients: ['50 мл водки', '100 мл Red Bull', 'Лед', 'Лимон (долька для украшения)'],
		preparation: 'Наполните стакан льдом.\n' +
			'Добавьте водку.\n' +
			'Долейте Red Bull и тоник.\n' +
			'Перемешайте и украсьте долькой лимона.',
	},
	{
		name: 'Vodka Red Bull & Campari',
		ingredients: ['50 мл водки', '30 мл Campari', '120 мл Red Bull', 'Лед'],
		preparation: 'Наполните стакан льдом. Добавьте водку и Campari. Долейте Red Bull. Перемешайте и подавайте.',
	},
	{
		name: ' Vodka Red Bull & Orange',
		ingredients: ['50 мл водки', '150 мл Red Bull', 'Лед', 'Апельсин (долька для украшения)'],
		preparation: 'Наполните стакан льдом.\n' +
			'Добавьте водку.\n' +
			'Долейте Red Bull.\n' +
			'Перемешайте и украсьте долькой апельсина.',
	},
];