// data/cocktailData.ts
export interface Cocktail {
	name: string;
	ingredients: string[];
	preparation: string;
}

export const cocktails: Cocktail[] = [
	{
		name: 'APEROL SPRITZ',
		ingredients: ['60 мл апероля', '90 мл игристого вина (или газированная вода)', '30 мл тоника', 'Лед', 'Апельсин'],
		preparation: 'Наполните бокал льдом. Добавьте апероль, шампанское и тоник. Перемешайте и украсьте долькой апельсина.' +
			'Подсказка от Поли: мне нравится добавлять и тоник, и газированную воду, так коктейль получается легче. А чтобы насытить его апельсиновым ароматом, выжмите дольку апельсина.',
	},
	{
		name: 'MARTINI FIERO TONIC',
		ingredients: ['10 мл Martini Fiero', '100 мл тоника', 'Лед', 'Апельсин'],
		preparation: 'Наполните бокал льдом. Добавьте вермут «Martini Fiero»и тоник. Перемешайте и украсьте долькой апельсина.',
	},
	{
		name: 'GOURME GRAPEFRUIT SPRITZ',
		ingredients: ['50 мл Онегин Gourmet Грейпфрут', '50 мл розового игристого вина', '100 мл тоника', 'Лед', 'Лайм'],
		preparation: 'Наполните бокал льдом, добавьте настойку Онегин Gourmet Грейпфрут, тоник, игристое вино, перемешайте и украсьте долькой лайма.',
	},
	{
		name: 'GIN TONIC ORIGINAL',
		ingredients: ['50 мл джина «Original»', '150 мл тоника', 'Лед', 'Лайм'],
		preparation: 'Наполните стакан льдом. Добавьте джин и тоник. Перемешайте и украсьте долькой лайма.',
	},
	{
		name: 'GIN TONIC GOURME',
		ingredients: ['50 мл джина «Mandarin & Rosemary»', '150 мл тоника', 'Лед', 'Апельсин'],
		preparation: 'Наполните стакан льдом. Добавьте джин и тоник. Перемешайте и украсьте долькой апельсина.',
	},
	{
		name: 'GIN TONIC FRESH',
		ingredients: ['50 мл джина на ваш вкус', '150 мл тоника', 'Лед', 'Долька огурца', 'Апельсин'],
		preparation: 'Наполните стакан льдом. Положите слайс огурца и выжмите дольку лайма. Добавьте джин и тоник, перемешайте',
	},
	{
		name: 'SUMMER GOODBYE',
		ingredients: ['330 мл пива Corona Extra', 'Долька лайма'],
		preparation: 'Откройте бутылочку пива Corona Extra, выдавите и положите в горлышко дольку лайма. Наслаждайтесь ',
	},
];